FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/LPC1756_GPDMA.c
const HAL_GPDMA LPC1756_GPDMA_Channel6_Interface = {
        {
                "GPDMA:LPC1756:CH6",
                0x0100,
                LPC1756_GPDMA_InitializeWorkspace_Channel6,
                sizeof(T_LPC1756_GPDMA_Workspace), },
        LPC1756_GPDMA_PrepareRequest,
        LPC1756_GPDMA_Start,
        LPC1756_GPDMA_Stop,
        LPC1756_GPDMA_IsValidAddress, };

const HAL_GPDMA LPC1756_GPDMA_Channel7_Interface = {
        {
                "GPDMA:LPC1756:CH7",
                0x0100,
                LPC1756_GPDMA_InitializeWorkspace_Channel7,
                sizeof(T_LPC1756_GPDMA_Workspace), },
        LPC1756_GPDMA_PrepareRequest,
        LPC1756_GPDMA_Start,
        LPC1756_GPDMA_Stop,
        LPC1756_GPDMA_IsValidAddress, };

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC1756_GPDMA0_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("GPDMA0",
            (T_halInterface *)&LPC1756_GPDMA_Channel0_Interface, 0, 0);
}

void LPC1756_GPDMA1_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("GPDMA1",
            (T_halInterface *)&LPC1756_GPDMA_Channel1_Interface, 0, 0);
}

void LPC1756_GPDMA2_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("GPDMA2",
            (T_halInterface *)&LPC1756_GPDMA_Channel2_Interface, 0, 0);
}

void LPC1756_GPDMA3_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("GPDMA3",
            (T_halInterface *)&LPC1756_GPDMA_Channel3_Interface, 0, 0);
}

void LPC1756_GPDMA4_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("GPDMA4",
            (T_halInterface *)&LPC1756_GPDMA_Channel4_Interface, 0, 0);
}

void LPC1756_GPDMA5_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("GPDMA5",
            (T_halInterface *)&LPC1756_GPDMA_Channel5_Interface, 0, 0);
}

void LPC1756_GPDMA6_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("GPDMA6",
            (T_halInterface *)&LPC1756_GPDMA_Channel6_Interface, 0, 0);
}

void LPC1756_GPDMA7_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("GPDMA7",
            (T_halInterface *)&LPC1756_GPDMA_Channel7_Interface, 0, 0);
}

/*-------------------------------------------------------------------------*
 * End of File:  GPDMA.c
 *-------------------------------------------------------------------------*/
